---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotConstrainBasePointAlignments
source: html/3efbcd20-13d2-e518-a827-bd56d200812f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotConstrainBasePointAlignments Property

Alignments to base points cannot be constrained.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConstrainBasePointAlignments { get; }
```